# StairsRunActualTreadDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunActualTreadDepth Property
ParameterTypeId Class See Also
---
"Actual Tread Depth": Actual Tread Depth
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunActualTreadDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunActualTreadDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunActualTreadDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace